/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   pars_args.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: gloras-t <gloras-t@student.21-school.ru    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/07/02 11:35:28 by gloras-t          #+#    #+#             */
/*   Updated: 2020/07/02 11:37:37 by gloras-t         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_ls.h"

int	parse_flag(char *arg)
{
	//если первый символ "-" то отдаем этой функции	
}

int	parse_path(char *arg)
{
	//если арргумент не начинается с "-" то отдаем этой функции
}

//-a - flag
//a - папка? файл? путь?

